Autodesk.Revit.DB.DoorEvacuationExitType
An enumerated type listing the possible door evacuation types

Autodesk.Revit.DB.DoorEvacuationExitType.None
Not used for exit access.

Autodesk.Revit.DB.DoorEvacuationExitType.InteriorPassage
Interior passage door.

Autodesk.Revit.DB.DoorEvacuationExitType.InteriorExit
Interior exit door.

Autodesk.Revit.DB.DoorEvacuationExitType.ExteriorExit
Exterior exit door.